Revit 2027 API
Stairs.DesiredRisersNumber Property
 The number of risers is calculated based on the height between levels.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int DesiredRisersNumber { get; set; }
Public Property DesiredRisersNumber As Integer
	Get
	Set
public:
property int DesiredRisersNumber {
	int get ();
	void set (int value);
}
member DesiredRisersNumber : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for numberOfRisers is not positive.
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace